<h1>Jan Andersson - sba20368</h1>

In [1]:
import pandas as pd
import numpy as np

# Visualization libraries
import matplotlib as plt
import seaborn as sns

<h3>Supressing warnings</h3>
<p>Supressing warning in pandas library when doing some operations as they take up most of the space of the output and are not code critical</p>

In [2]:
import warnings
warnings.filterwarnings("ignore")

<h3>Loading data and preparing data</h3>
<p>Loading the data into a dataframe from a Comma-separated values (CSV) dataset titled:
<ul>
  <li><code>cattle_births_month_county.csv</code></li>
  <li><code>Supply.csv</code></li>
  <li><code>Milk_Sales_for_Human_Consumption.csv</code></li>
</ul>

<h4>The aim</h4>
To load the dataset using the CSV pandas load protocol and present the metadata of the dataset in order to get aquianted with the shape of the data.

In [3]:
data_Births = pd.read_csv('cattle_births_month_county.csv')
data_Supply = pd.read_csv('Supply.csv')
data_Sales = pd.read_csv('Milk_Sales_for_Human_Consumption.csv')

In [4]:
data_Births.head(5)

   BIRTH_YEAR COUNTY_ORIGIN BIRTH_MONTH CALF_BREED_TYPE  TOTAL_BIRTH
0        2016        CARLOW         APR            BEEF         3670
1        2016        CARLOW         APR           DAIRY          680
2        2016        CARLOW         AUG            BEEF          778
3        2016        CARLOW         AUG           DAIRY           80
4        2016        CARLOW         DEC            BEEF          835

In [ ]:
sns.pairplot(data_Births)

In [5]:
data_Supply.head(5)

,STATISTIC,Statistic Label,TLIST(A1),Year,C02064V02491,Product Type,UNIT,VALUE
0,ABA02C01,Usable Dairy Production,1992,1992,3,Cheese,Tonnes,94.0
1,ABA02C01,Usable Dairy Production,1992,1992,4,Butter,Tonnes,144.0
2,ABA02C01,Usable Dairy Production,1992,1992,5,Cream,Tonnes,21.0
3,ABA02C01,Usable Dairy Production,1992,1992,6,Milk Powder,Tonnes,157.0
4,ABA02C01,Usable Dairy Production,1992,1992,11,Drinking Milk & Buttermilk,Tonnes,615.0

In [ ]:
sns.pairplot(data_Supply)

In [6]:
data_Sales.head(5)

,STATISTIC,STATISTIC Label,TLIST(M1),Month,C02064V02491,Type of Milk,UNIT,VALUE
0,AKM02,Milk Sales (Dairy) for Human Consumption,198001,1980 January,1,All Milk,Million Litres,38.2
1,AKM02,Milk Sales (Dairy) for Human Consumption,198001,1980 January,12,Whole Milk,Million Litres,38.2
2,AKM02,Milk Sales (Dairy) for Human Consumption,198001,1980 January,13,Skimmed and Semi-skimmed milk,Million Litres,NaN
3,AKM02,Milk Sales (Dairy) for Human Consumption,198001,1980 January,14,Skimmed Milk,Million Litres,NaN
4,AKM02,Milk Sales (Dairy) for Human Consumption,198001,1980 January,15,Semi-skimmed milk,Million Litres,NaN

In [ ]:
sns.pairplot(data_Sales)

<h1></h1>